{
    "query": "impact of nuclear energy on environment",
    "start_year": 2024,
    "end_year": 2024,
    "results_per_year": 13016,
    "top_n": 5,
    "results": [
        {
            "Title": "Challenges and Perspectives of Deep Geological Repositories for Nuclear Energy",
            "Authors": "Fall M.",
            "abstract": "Sustainable development and environmental preservation are unattainable without addressing climate change and its severe impacts. A key component of this effort is the adoption of clean energy technologies, such as nuclear, wind, and solar energy, which are essential to achieving net zero greenhouse gas (GHG) emissions by 2050. Nuclear energy, in particular, is crucial for reaching this goal both in Canada and globally. Currently, nuclear power supplies approximately 10% of the world's electricity, 15% of Canada’s, and 60% of Ontario's needs. Despite its benefits, nuclear energy generation results in the production of hazardous nuclear waste. The sustainable and safe management of this waste is paramount, and several countries around the world are investigating the use of deep geological repositories, which involve the disposal of nuclear waste in deep rock formations, as sustainable solutions for nuclear waste. This lecture will address the significant geotechnical engineering challenges associated with the design and implementation of deep geological repositories for nuclear waste. It will present the latest research advancements aimed at overcoming these technical obstacles and explore the future prospects of deep geological repositories as a sustainable solution for nuclear waste management. © 2024, Avestia Publishing. All rights reserved.",
            "DOI": "https://doi.org/10.11159/iccste24.005",
            "Similarity": "0.4570"
        },
        {
            "Title": "A review on emerging mixed-spectrum nuclear reactors for safety and sustainability of nuclear energy systems",
            "Authors": "Zhang T.; Sun Q.; Xiao W.; Luo C.; Liu X.",
            "abstract": "The goals of achieving net-zero CO2 emissions and bolstering energy security have increased the interest in nuclear power in recent years. Existing nuclear reactors are typically designed based on a thermal or fast neutron spectrum. The thermal neutron spectrum is advantageous for enhancing fission reaction, whereas the fast neutron spectrum is beneficial for fissile breeding and radioactive waste incineration. However, the thermal-spectrum reactor has problems such as limited fuel utilization and long-lived nuclear waste production, while the fast-spectrum reactor faces issues such as a small void feedback coefficient and the potential of proliferation. A mixed-spectrum nuclear reactor is a design that combines thermal spectrum and fast spectrum within a single nuclear reactor, hence combining the benefits of thermal spectrum and fast spectrum for versatile application reasons. In order to provide a full understanding of this revolutionary reactor concept, this study offers a review of global reports on emerging mixed-spectrum reactor techniques. The mixed-spectrum design has been examined in a variety of reactor types, including supercritical water-cooled reactors, fusion-fission hybrid reactors, test reactors, liquid-metal-cooled reactors, gas-cooled reactors, and accelerator driven systems, etc. These activities and ideas have revealed the potential of mixed-spectrum nuclear reactors for enhancing fuel utilization, nuclear waste transmutation, non-proliferation, nuclear material testing, etc. It is envisaged that in the future the mixed-spectrum nuclear reactor may serve as a multi-purpose reactor type enhancing the safety and sustainability of nuclear energy systems. © 2024",
            "DOI": "https://doi.org/10.1016/j.rser.2024.114666",
            "Similarity": "0.4285"
        },
        {
            "Title": "Is nuclear energy really sustainable? A critical analysis on the example of the Polish energy transition plan",
            "Authors": "Pieńkowski D.",
            "abstract": "The Green Deal of the European Union is to be a policy of sustainable transition from the long-term perspective; however, the ambitious plans were confronted with the energy crisis in 2022 and controversial position on two non-renewables: nuclear energy and gas. These have been formally recognized as sustainable energy sources and potential bases for direct investments. This paper deals with the sustainability of nuclear energy in the context of the new taxonomy. It offers a critical review and alternative approaches to the evaluation of the costs and benefits of nuclear energy to illustrate its unsustainability. As a result, a critical evaluation of nuclear energy from the perspective of the key goals of the sustainable energy transition is offered. It determines the most violated areas of the sustainable transition, such as decentralization and civil engagement, safety, and renewability. Additionally, the Polish nuclear program is discussed to illustrate greenwashing and the typical problems in the evaluation of nuclear energy projects. The results suggest that the commercial use of nuclear energy should not be included in the sustainable energy transition programs, although the research on nuclear technologies should be further supported due to the long-lasting consequences of its use since the 1950s. © 2024 The Author",
            "DOI": "https://doi.org/10.1016/j.esd.2024.101376",
            "Similarity": "0.3980"
        },
        {
            "Title": "Role of nuclear energy, geothermal energy, agriculture, and urbanization in environmental stewardship",
            "Authors": "Ramzan M.; Razi U.; Usman M.; Sarwar S.; Talan A.; Mundi H.S.",
            "abstract": "The global issue of atmospheric variations and global warming caused by diverse anthropogenic behaviors is a global concern. There is apprehension about preserving an uncontaminated atmosphere and attaining optimal nuclear and geothermal energy utilization with agriculture sector development. In this regard, this paper investigates the influence of nuclear energy, geothermal energy, agriculture development, and urbanization on carbon emissions and ecological footprint from 1990Q1 to 2019Q4 in the case of China. The findings of unit root tests reveal that all variables are stationary at first integration order, and cointegration test findings confirm the presence of long-run relationships among series. The quantile autoregressive distributive lag (QARDL) method findings demonstrate that nuclear energy, geothermal energy, and urbanization statistically correlate with CO2 emissions and ecological footprint across all quantiles, indicating that these determinants have contributed to environmental degradation. Whereas agricultural development has a statistically significant and negative influence on the environment, implying that agriculture has a pollution-mitigation impact. Based on these empirical findings, several policy implications are presented to preserve environmental quality to achieve the 2030 Sustainable Development Goals (SDGs) target. © 2023 International Association for Gondwana Research",
            "DOI": "https://doi.org/10.1016/j.gr.2023.08.006",
            "Similarity": "0.3827"
        },
        {
            "Title": "Molecular Hosts for the Sensing and Separation of 99TcO4−",
            "Authors": "La Cognata S.; Marie C.; Guilbaud P.; Poggi A.; Amendola V.",
            "abstract": "In recent years, European Union member states have hastened energy policy deliberations to address supply and sustainability concerns, placing a significant emphasis on nuclear energy as a means to achieve decarbonization goals. However, despite its significant role in power generation, nuclear energy faces significant challenges linked to fuel reprocessing and waste disposal, that hinder its broader expansion. In this context, the separation of technetium represents a concerning issue. Indeed, technetium‘s catalytic activity can impede the extraction of uranium, neptunium, and plutonium, affecting waste reprocessing efficiency. Additionally, the stable form of technetium in aerobic conditions, pertechnetate (TcO4−), poses risks of groundwater contamination due to its mobility and solubility. Hence, sensing and separation of TcO4− is imperative for both nuclear fuel processing and minimising radioactive contamination in the environment. However, the binding of TcO4− and its separation from contaminated solutions present challenges due to the acidic (or basic) waste components and the high ionic strength in real matrices. Supramolecular chemists have addressed these issues by designing receptors inspired by molecular recognition principles. This article explores recent advancements and future directions in TcO4− sensing and separation (using extraction and sorption) with a focus on molecular hosts. Metal-organic receptors will also be discussed. © 2024 Wiley-VCH GmbH.",
            "DOI": "https://doi.org/10.1002/chem.202401551",
            "Similarity": "0.3782"
        }
    ],
    "model": "use",
    "sim_measure": "cosine"
}