{
    "query": "Nuclear energy and its role in sustainable development. Major factors driving the revolution of nuclear science and future directions",
    "start_year": 2024,
    "end_year": 2024,
    "results_per_year": 13016,
    "top_n": 10,
    "results": [
        {
            "Title": "Advanced development of nuclear power as a factor in ensuring sustainable development of humanity",
            "Authors": "Podchufarov A.Y.; Galkina A.N.; Vanina S.S.",
            "abstract": "The future of nuclear power has been widely discussed by the scientific community and the public, which is explained by the high potential of peaceful nuclear technologies in providing mankind with affordable energy, preserving the climate, developing industry, medicine, science, and education. The materials of the study are devoted to assessing the impact of nuclear power on modern challenges and achieving indicators that are reflected in the Sustainable Development Goals. The paper uses the provisions of the intersystem interaction theory, system models for managing basic target indicators, methods of correlation, regression, autoregression analysis. The study confirmed the positive impact of nuclear power on the integral indicators of sustainable development. Considering the resource constraints, the preferred scenario for nuclear power development was substantiated, and its impact on achieving the integral indicators of the Sustainable Development Goals was assessed. © Podchufarov AYu et al.",
            "DOI": "https://doi.org/10.3897/nucet.10.130483",
            "Similarity": "0.7592",
            "Overlap": "52.94"
        },
        {
            "Title": "Challenges and Perspectives of Deep Geological Repositories for Nuclear Energy",
            "Authors": "Fall M.",
            "abstract": "Sustainable development and environmental preservation are unattainable without addressing climate change and its severe impacts. A key component of this effort is the adoption of clean energy technologies, such as nuclear, wind, and solar energy, which are essential to achieving net zero greenhouse gas (GHG) emissions by 2050. Nuclear energy, in particular, is crucial for reaching this goal both in Canada and globally. Currently, nuclear power supplies approximately 10% of the world's electricity, 15% of Canada’s, and 60% of Ontario's needs. Despite its benefits, nuclear energy generation results in the production of hazardous nuclear waste. The sustainable and safe management of this waste is paramount, and several countries around the world are investigating the use of deep geological repositories, which involve the disposal of nuclear waste in deep rock formations, as sustainable solutions for nuclear waste. This lecture will address the significant geotechnical engineering challenges associated with the design and implementation of deep geological repositories for nuclear waste. It will present the latest research advancements aimed at overcoming these technical obstacles and explore the future prospects of deep geological repositories as a sustainable solution for nuclear waste management. © 2024, Avestia Publishing. All rights reserved.",
            "DOI": "https://doi.org/10.11159/iccste24.005",
            "Similarity": "0.7568",
            "Overlap": "52.94"
        },
        {
            "Title": "BIBLIOMETRIC ANALYSIS OF THE GREATEST NUCLEAR DISASTERS: WHAT IS KNOWN SO FAR AND WHAT ARE THE PROSPECTS?",
            "Authors": "Batur M.; Alkan R.M.",
            "abstract": "The high potential of nuclear power to combat climate change and support sustainable development plays a critical role in achieving the goal of the Paris Agreement. Moreover, with the ever-increasing demand for electricity, it is essential to consider nuclear power as a reliable source of energy. However, it should be noted that although the risk of a radiological accident is small, it always exists, and therefore it is crucial to have a complete understanding of the management of nuclear power. Herein, we present a statistical review of nuclear accident research at Chernobyl and Fukushima Nuclear Power Plants using bibliometric analysis to identify key patterns in scientific results and current issues in accident research. More than 10,000 articles have been collected from the SCOPUS database covering the periods 1986–2022 and 2011–2022 on Chernobyl and Fukushima, respectively. The results were obtained from two perspectives: first, we identified stages through which pre- and post-accident researches have evolved, and then we analysed the spatial correlation between energy-economic performance and scientific literature for the leading productive countries. From the analysis of research trends, it was found that the number of articles increased sharply immediately after the accident and slightly decreased over time. Among the most attractive subject categories in terms of the largest number of publications and received citations were environmental sciences, medicine and energy policy. The productive country ranking was mostly topped by the country in which the accident occurred. Spatial statistical analysis revealed a strong correlation between the scientific productivity and energy-economic performance of the leading countries. © Author(s) 2024.",
            "DOI": "https://doi.org/10.5194/isprs-archives-XLVIII-4-W9-2024-61-2024",
            "Similarity": "0.7316",
            "Overlap": "47.06"
        },
        {
            "Title": "Examining Stakeholder Perspectives on Nuclear Sustainability: The Role of Digital Media and Public Trust in the Gulf Cooperation Council",
            "Authors": "Abdeldayem M.M.; Aldulaimi S.H.; Abo Keir M.Y.; Baqi A.; Muttar A.K.",
            "abstract": "This study examines possible stakeholder perspectives on nuclear sustain ability, with a focus on the general public in the Gulf Cooperation Council and the United Arab Emirates. The goal is to ascertain how much consensus there is among these stakeholders on the environmental benefits of nuclear energy. The study also looks at how the public's confidence in the sustainability of nuclear energy is affected when stakeholders are engaged remotely in nuclear practices through social media as a digital media channel. The research utilizes a critical analysis methodology to investigate public trust dynamics in nuclear energy sustainability in the context of online discussions. It aims to evaluate the efficacy of social media platforms in involving stakeholders and promoting candid conversations regarding nuclear energy procedures. The study intends to investigate how much public perceptions and levels of confidence in the sustainability of nuclear energy are influenced by remote stakeholder engagement through the use of digital media channels. The study takes into account the distinct cultural, social, and economic contexts of the Gulf Cooperation Council and the United Arab Emirates, concentrating on their general public. The study intends to offer important insights into the role of digital dialogues in forming public trust in nuclear sustainability by examining public sentiment and attitudes toward nuclear energy through social media interactions.  © 2024 IEEE.",
            "DOI": "https://doi.org/10.1109/ICETSIS61505.2024.10459660",
            "Similarity": "0.7098",
            "Overlap": "41.18"
        },
        {
            "Title": "A review on emerging mixed-spectrum nuclear reactors for safety and sustainability of nuclear energy systems",
            "Authors": "Zhang T.; Sun Q.; Xiao W.; Luo C.; Liu X.",
            "abstract": "The goals of achieving net-zero CO2 emissions and bolstering energy security have increased the interest in nuclear power in recent years. Existing nuclear reactors are typically designed based on a thermal or fast neutron spectrum. The thermal neutron spectrum is advantageous for enhancing fission reaction, whereas the fast neutron spectrum is beneficial for fissile breeding and radioactive waste incineration. However, the thermal-spectrum reactor has problems such as limited fuel utilization and long-lived nuclear waste production, while the fast-spectrum reactor faces issues such as a small void feedback coefficient and the potential of proliferation. A mixed-spectrum nuclear reactor is a design that combines thermal spectrum and fast spectrum within a single nuclear reactor, hence combining the benefits of thermal spectrum and fast spectrum for versatile application reasons. In order to provide a full understanding of this revolutionary reactor concept, this study offers a review of global reports on emerging mixed-spectrum reactor techniques. The mixed-spectrum design has been examined in a variety of reactor types, including supercritical water-cooled reactors, fusion-fission hybrid reactors, test reactors, liquid-metal-cooled reactors, gas-cooled reactors, and accelerator driven systems, etc. These activities and ideas have revealed the potential of mixed-spectrum nuclear reactors for enhancing fuel utilization, nuclear waste transmutation, non-proliferation, nuclear material testing, etc. It is envisaged that in the future the mixed-spectrum nuclear reactor may serve as a multi-purpose reactor type enhancing the safety and sustainability of nuclear energy systems. © 2024",
            "DOI": "https://doi.org/10.1016/j.rser.2024.114666",
            "Similarity": "0.7013",
            "Overlap": "41.18"
        },
        {
            "Title": "Safeguarding Biodiversity and Future Generations: An Application of RESRAD Codes for Nuclear Emergency Planning and Response",
            "Authors": "Bello S.; Simon J.; Ahmad U.F.; Aliyu A.S.; Godwin I.; Nasiru A.M.; Yusuf J.A.",
            "abstract": "The Chernobyl and Fukushima nuclear accidents have significantly impacted the public’s perception of nuclear energy and its potential benefits. To fully harness nuclear technology’s potential for contributing to the Sustainable Development Goals (SDGs), as highlighted by the IAEA bulletin of September 2016, we must restore public confidence in this energy source. Emergency preparedness and response is a cardinal principle of radiation protection, and the literature review indicates that most research and energy reactors worldwide have modelled hypothetical accident release scenarios. However, most of these models only considered respirable gaseous radionuclides released from the reactor core and failed to consider other possible exposure media, routes, and scenarios. In this paper, we propose a framework for using the RESRAD family of codes to improve emergency preparedness and response planning, especially in Africa, where site-specific data is lacking. By critically analyzing related literature through a desk review, we demonstrate the application of these codes in biodiversity conservation, protecting people and the environment, and safeguarding future generations. Our proposed frameworks, if implemented, will build public confidence in nuclear energy projects in Africa, restoring public confidence and consequently help in solving the lingering energy crisis on the continent. © The Author(s), under exclusive license to Springer Nature Switzerland AG 2024.",
            "DOI": "https://doi.org/10.1007/978-3-031-64362-0_59",
            "Similarity": "0.6969",
            "Overlap": "52.94"
        },
        {
            "Title": "Molecular Hosts for the Sensing and Separation of 99TcO4−",
            "Authors": "La Cognata S.; Marie C.; Guilbaud P.; Poggi A.; Amendola V.",
            "abstract": "In recent years, European Union member states have hastened energy policy deliberations to address supply and sustainability concerns, placing a significant emphasis on nuclear energy as a means to achieve decarbonization goals. However, despite its significant role in power generation, nuclear energy faces significant challenges linked to fuel reprocessing and waste disposal, that hinder its broader expansion. In this context, the separation of technetium represents a concerning issue. Indeed, technetium‘s catalytic activity can impede the extraction of uranium, neptunium, and plutonium, affecting waste reprocessing efficiency. Additionally, the stable form of technetium in aerobic conditions, pertechnetate (TcO4−), poses risks of groundwater contamination due to its mobility and solubility. Hence, sensing and separation of TcO4− is imperative for both nuclear fuel processing and minimising radioactive contamination in the environment. However, the binding of TcO4− and its separation from contaminated solutions present challenges due to the acidic (or basic) waste components and the high ionic strength in real matrices. Supramolecular chemists have addressed these issues by designing receptors inspired by molecular recognition principles. This article explores recent advancements and future directions in TcO4− sensing and separation (using extraction and sorption) with a focus on molecular hosts. Metal-organic receptors will also be discussed. © 2024 Wiley-VCH GmbH.",
            "DOI": "https://doi.org/10.1002/chem.202401551",
            "Similarity": "0.6913",
            "Overlap": "58.82"
        },
        {
            "Title": "Exploring Nuclear Energy to meet Sustainable Development Goals",
            "Authors": "Awogbemi O.; Adediran A.A.; Elewa R.L.; Bello K.A.; Ibikunle R.A.; Borokinni F.O.; Aladejobi Adedayo S.; Ikubanni P.P.",
            "abstract": "The United Nations in 2015 set 17 Sustainable Development Goals (SDGs) for the universal transformation of the world by ensuring economic growth, social inclusion, and environmental protection by 2030. The current study explores the contributions of nuclear energy to the attainment of SDGs. This intervention classifies the SDGs into six groups and highlights the areas of contribution, challenges, and policy recommendations of nuclear energy to the attainment of SDGs. Nuclear technology generates affordable, modern, and reliable electric power, clean hydrogen, and heat for wastewater desalination which contributes to ending poverty, universal access to quality education, eliminating gender inequality, protecting land and marine ecosystems, and providing clean water and sanitation. Despite inadequate public awareness, fear of nuclear proliferation, high costs of the technology, and other challenges, nuclear technology can contribute to the attainment of SDGs if the policy recommendations are implemented. The outcome of this study will provide more updated information on the application of nuclear energy in making life more pleasurable and timely attainment of SDGs. © 2024 IEEE.",
            "DOI": "https://doi.org/10.1109/SEB4SDG60871.2024.10629889",
            "Similarity": "0.6816",
            "Overlap": "41.18"
        },
        {
            "Title": "Is nuclear energy really sustainable? A critical analysis on the example of the Polish energy transition plan",
            "Authors": "Pieńkowski D.",
            "abstract": "The Green Deal of the European Union is to be a policy of sustainable transition from the long-term perspective; however, the ambitious plans were confronted with the energy crisis in 2022 and controversial position on two non-renewables: nuclear energy and gas. These have been formally recognized as sustainable energy sources and potential bases for direct investments. This paper deals with the sustainability of nuclear energy in the context of the new taxonomy. It offers a critical review and alternative approaches to the evaluation of the costs and benefits of nuclear energy to illustrate its unsustainability. As a result, a critical evaluation of nuclear energy from the perspective of the key goals of the sustainable energy transition is offered. It determines the most violated areas of the sustainable transition, such as decentralization and civil engagement, safety, and renewability. Additionally, the Polish nuclear program is discussed to illustrate greenwashing and the typical problems in the evaluation of nuclear energy projects. The results suggest that the commercial use of nuclear energy should not be included in the sustainable energy transition programs, although the research on nuclear technologies should be further supported due to the long-lasting consequences of its use since the 1950s. © 2024 The Author",
            "DOI": "https://doi.org/10.1016/j.esd.2024.101376",
            "Similarity": "0.6520",
            "Overlap": "47.06"
        },
        {
            "Title": "Global Development and Readiness of Nuclear Fusion Technology as the Alternative Source for Clean Energy Supply",
            "Authors": "Mohamed M.; Zakuan N.D.; Tengku Hassan T.N.A.; Lock S.S.M.; Mohd Shariff A.",
            "abstract": "Nuclear fusion is understood as an energy reaction that does not emit greenhouse gases, and it has been considered as a long-term source of low-carbon electricity that is favourable to curtail rapid climate change. Fusion offers a pathway to resolve energy security and the unequal distribution of energy resources since seawater is its ultimate fuel source and a few grams of fuel can generate mega kilowatts of power. The development and testing of new materials and technologies are unceasing to achieve the net fusion energy through national and international collaboration as well as private partnerships. The ever-growing number of research works report various designs and magnet-based fusion devices, such as stellarators, lasers, and tokamaks. This article provides an overview on the utilization of nuclear energy as a clean energy source, as well as the strategies and progress towards establishing successful commercial fusion energy to the grid and transition to a reliable clean energy source. The overview focuses on the fusion nuclear development in five major countries, UK, US, China, Japan, and Russia. Identified technical and financial challenges are also described at the end of this article. The International Thermonuclear Experimental Reactor (ITER) has been an international reference program for fusion energy development and most developed countries with nuclear development capacity are aiming to complete their in-house fusion energy facilities in parallel to ITER. Many fusion programs are finishing the conceptual design and shifting into the phase of engineering design for the planned DEMO fusion facilities. The significant challenges were identified from the perspective of device efficiency and robustness, sustainable funding, and facility maintenance and safety, which must be addressed diligently to realize fusion energy as alternative clean energy that mitigates climate change and supports the goals of energy security. © 2024 by the authors.",
            "DOI": "https://doi.org/10.3390/su16104089",
            "Similarity": "0.6502",
            "Overlap": "52.94"
        }
    ],
    "model": "stf",
    "sim_measure": "cosine"
}