{
    "query": "Nuclear energy and its role in sustainable development. Major factors driving the revolution of nuclear science and future directions",
    "start_year": 2024,
    "end_year": 2024,
    "results_per_year": 13016,
    "top_n": 10,
    "results": [
        {
            "Title": "Challenges and Trends in Green Finance in the Context of Sustainable Development—A Bibliometric Analysis",
            "Authors": "Krastev B.; Krasteva-Hristova R.",
            "abstract": "Green finance in the context of sustainable development sits within the broader discourse of environmental economics and sustainable finance. Their integration has become imperative in addressing global challenges, with the aims of understanding how financial mechanisms can be aligned with sustainability goals, investigating the role of green finance in promoting environmentally friendly investments, and fostering sustainable development. This bibliometric analysis explores the evolution, trends, and challenges in green finance research. It examines 436 articles published between 2016 and 2024, revealing insights into influential publications, authors, journals, institutions, and countries engaged in green finance for sustainability. The study identifies China, the UK, and Pakistan as leaders in research output and citation impact. Furthermore, it highlights the interdisciplinary nature of green finance, reflected in diverse publication outlets spanning environmental, social, and economic domains. The analysis underscores the increasing global interest in green finance, as evidenced by the growing citation rates over time. Key findings include the pivotal role of green finance in energy efficiency, renewable energy development, and the promotion of sustainable economic growth. Overall, this research provides valuable insights for policymakers, researchers, and practitioners, emphasizing the importance of interdisciplinary collaboration and continued research efforts in advancing sustainable finance agendas. © 2024 by the authors.",
            "DOI": "https://doi.org/10.3390/jrfm17070301",
            "Similarity": "0.9344",
            "Overlap": "47.06"
        },
        {
            "Title": "Education in renewable energies: A key factor of Morocco's 2030 energy transition project. Exploring the impact on SDGs and future perspectives",
            "Authors": "Daoudi M.",
            "abstract": "This article provides a comprehensive assessment of renewable energy education in the Moroccan context and its significance within the 2030 Energy Transition Project. It examines various aspects, including the role of education in driving the energy transition and the specific target groups of renewable energy education initiatives. The analysis further explores pedagogical approaches, learning tools and the training required for educators and trainers in the field of renewable energy. Community engagement and awareness are also emphasized as crucial factors in renewable energy education, along with an evaluation of its impact on the Sustainable Development Goals (SDGs) in Morocco. Lastly, the article considers future prospects and potential advancements in renewable energy education. Through this exploration, the study aims to provide valuable insights for the improvement and advancement of renewable energy education in Morocco. © 2024 The Author",
            "DOI": "https://doi.org/10.1016/j.ssaho.2024.100833",
            "Similarity": "0.9323",
            "Overlap": "64.71"
        },
        {
            "Title": "Energy access and sustainable development for displaced populations: Achieving energy justice in the Rohingya refugee camps of Cox's Bazar, Bangladesh",
            "Authors": "Rafa N.; Khalid R.; Uddin S.M.N.",
            "abstract": "Despite the pivotal role of energy in shaping daily life, its intricate dynamics remain underexplored within humanitarian contexts. This study examines the energy landscape within the Rohingya refugee camps, highlighting the implications of energy poverty for the Sustainable Development Goals (SDGs). Using the energy justice framework, the study identifies three forms of energy injustice experienced by the Rohingya refugees- distributional, recognition, and procedural injustices- arising from inadequate distribution of energy access, financing and resources scarcity, non-recognition of refugees' energy needs, and poor representation of the refugees in energy-related decision-making. Drawing on in-depth interviews, the study illustrates how these injustices cause extreme energy poverty, leading to adverse impacts on food security, health, gender equality, education, and overall living conditions, undermining several SDGs and underscoring the need for integrating energy justice principles into humanitarian strategies. The study concludes that the failure to address these energy injustices perpetuates a cycle of energy poverty and disenfranchisement of refugees, emphasizing the necessity of collaborative governance structures that actively involve refugees in decision-making processes. It further calls for multi-scalar and multi-sectoral collaborations, holistic energy planning approaches, and diversified funding strategies. As we navigate the intricacies of energy poverty in displaced settings, this research raises critical questions about the future of energy transitions for camp-based refugee populations in protracted crises, urging further exploration of the broader geopolitical, social, and environmental factors influencing energy justice in such contexts. © 2024 The Authors",
            "DOI": "https://doi.org/10.1016/j.erss.2024.103621",
            "Similarity": "0.9313",
            "Overlap": "58.82"
        },
        {
            "Title": "Exploring the impact of sustainable finance on carbon emissions: Policy implications and interactions with low-carbon energy transition from China",
            "Authors": "Zhang W.; Han J.; Kuang S.; Işık C.; Su Y.; Ju Lai Ti G.L.N.G.E.; Li S.; Xia Z.; Muhammad A.",
            "abstract": "With the increasing attention to environmental degradation and sustainable development goals, the low-carbon energy transition has emerged as a focal point in both academic and political realms. This research examines, under the framework of the Environmental Kuznets Curve, the impact of low-carbon energy transition, natural resource rents, and economic growth on environmental performance. Additionally, it delves into the regulatory role of green finance and transition finance in the nexus between low-carbon energy transition and environmental performance. The research findings reveal that the influence of low-carbon energy transition, economic growth, and natural resource rents on environmental performance exhibits distinct regional heterogeneity. The research also verifies the premise that the Environmental Kuznets Curve exists exclusively in the eastern area of China. Further investigation indicates that sustainable finance plays a crucial regulatory role in the relationship between low-carbon energy transition and environmental performance. According to these results, the paper suggests that provinces should establish dual environmental and economic goals and optimize financial policy design. Moreover, governments and enterprises should achieve sustainable development goals through means such as technological innovation, regulatory frameworks, and market mechanisms. © 2024 Elsevier Ltd",
            "DOI": "https://doi.org/10.1016/j.resourpol.2024.105272",
            "Similarity": "0.9299",
            "Overlap": "41.18"
        },
        {
            "Title": "Exploring the Role of Digital Economy in Enhanced Green Productivity in China’s Manufacturing Sector: Fresh Evidence for Achieving Sustainable Development Goals",
            "Authors": "Zhao F.; Xu Z.; Xie X.",
            "abstract": "Confronted with challenges such as escalating demand, expanding energy consumption, and emissions, China’s manufacturing sector stands at a pivotal juncture on its path towards sustainable development. Against the backdrop of a new wave of technological revolution and industrial transformation, exploring how the digital economy can foster growth in green total factor productivity (GTFP), particularly amidst technological diversification, holds significant importance for realizing sustainable development objectives. This study employs the system generalized method of moments (System GMM), encompassing 30 provinces in China, to delve deeply into the notable and dynamic correlation between the development index of the digital economy and GTFP. The findings reveal that the advancement of the digital economy significantly influences GTFP, underscoring its direct and enduring impact on green productivity. Key mechanisms through which the digital economy promotes green productivity are identified, including resource optimization, green technological innovation, data-driven decision making, and the transformation of environmentally sustainable behaviors. By bridging gaps in existing literature, this study integrates economic and environmental perspectives, emphasizing the necessity for formulating digital innovation policies aligned with environmental objectives. It provides richer insights into the role of the digital economy in enhancing GTFP, accentuating the potential of digital technologies in driving green transformation. With its holistic approach, this study combines economic efficiency with environmental sustainability, offering crucial guidance for policymakers and industry stakeholders in crafting sustainable development strategies. © 2024 by the authors.",
            "DOI": "https://doi.org/10.3390/su16104314",
            "Similarity": "0.9288",
            "Overlap": "64.71"
        },
        {
            "Title": "The role of business and management in driving the sustainable development goals (SDGs): Current insights and future directions from a systematic review",
            "Authors": "Mahajan R.; Kumar S.; Lim W.M.; Sareen M.",
            "abstract": "The pursuit of sustainable development goals (SDGs) extends beyond governmental responsibility, demanding active engagement from businesses and managers. This study systematically reviews SDG-related research within the fields of business and management to elucidate their roles in advancing this global agenda. By analyzing a corpus of pertinent studies from Scopus and Web of Science through bibliometric–content analysis, this study not only identifies publication trends, prominent contributors, theories, contexts, and methods but also uncovers the evolving roles of businesses and managers in driving the SDGs. The main themes emerging from this analysis include (1) forging sustainable partnerships, practices, and policies, reflecting businesses' role in stakeholder collaboration and policymaking; (2) addressing contemporary sustainability challenges like artificial intelligence and the dynamics of emerging economies; (3) balancing economic advancement with environmental sustainability, highlighting businesses' impact on ecological footprints and the importance of green finance; (4) integrating financial development considerations with ecological responsibility; (5) promoting equity and well-being, underscoring the influence of businesses and managers on societal welfare; and (6) shaping governance frameworks for sustainable production and consumption. These themes collectively paint a comprehensive picture of how business and management practices are crucial in achieving the SDGs, offering insights into current contributions, and charting potential pathways for future research and implementation. © 2024 ERP Environment and John Wiley & Sons Ltd.",
            "DOI": "https://doi.org/10.1002/bse.3712",
            "Similarity": "0.9279",
            "Overlap": "52.94"
        },
        {
            "Title": "Machine learning and the renewable energy revolution: Exploring solar and wind energy solutions for a sustainable future including innovations in energy storage",
            "Authors": "Bin Abu Sofian A.D.A.; Lim H.R.; Siti Halimatul Munawaroh H.; Ma Z.; Chew K.W.; Show P.L.",
            "abstract": "This article evaluates the present global condition of solar and wind energy adoption and explores their benefits and limitations in meeting energy needs. It examines the historical and evolutionary growth of solar and wind energy, global trends in the usage of renewable energy, and upcoming technologies, including floating solar and vertical-axis wind turbines. The importance of smart grid technology and energy storage alternatives for enhancing the effectiveness and dependability of renewable energy is explored. In addition, the role of Electric Vehicles (EVs) in a modern smart grid has been assessed. Furthermore, the economic benefits, and most recent technological developments of solar and wind energy and their environmental and social ramifications. The potential of solar and wind energy to meet the increasing global energy demand and the problems and opportunities facing the renewable energy industry have shown excellent promise. Machine learning applications for solar and wind energy generation are vital for sustainable energy production. Machine learning can help in design, optimization, cost reduction, and, most importantly, in improving the efficacy of solar and wind energy, including advancing energy storage. This assessment is a crucial resource for policymakers, industry leaders, and researchers who aim to make the world cleaner and more sustainable. Ultimately, this review has shown the great potential of solar and wind energy in meeting global energy demands and sustainable goals. © 2024 The Authors. Sustainable Development published by ERP Environment and John Wiley & Sons Ltd.",
            "DOI": "https://doi.org/10.1002/sd.2885",
            "Similarity": "0.9277",
            "Overlap": "41.18"
        },
        {
            "Title": "Comprehensive Review on Modelling and Optimization of Budget Allocation for Procurement of Alternative Gas Sources in Power Plant Industry",
            "Authors": "Oluwagbemiga O.O.; Bamidele A.; Olufemi A.B.",
            "abstract": "The transition to alternative gas sources in the power plant industry has become much imperative to reduce carbon emissions, diversify energy sources, and meet sustainability goals. The study plans to give a comprehensive analysis of the existing literature on modeling and optimization of budget allocation for the procurement of alternative gas sources in the power plant industry. The review encompasses studies from diverse perspectives, including mathematical modeling, optimization techniques, cost analysis, environmental impact assessment, and case studies. By synthesizing the findings and methodologies employed in previous research, this review identifies key trends, challenges, and opportunities in the field. This review highlights the significance of considering different factors such as procurement costs, infrastructure modifications, operational expenses, and environmental implications in the budget allocation process. Moreover, it examines the applications of mathematical optimization algorithms, sensitivity analysis, and scenario testing in achieving optimal budget allocation outcomes. The review further discusses the role of stakeholder engagement in various industries, regulatory frameworks, and technological advancements in shaping budget allocation strategies. Through this comprehensive examination of the current literature, this review plans to integrate the development of effective and sustainable budget allocation models for the procurement of alternative gas sources in the power plant industry © 2024 IEEE.",
            "DOI": "https://doi.org/10.1109/SEB4SDG60871.2024.10629825",
            "Similarity": "0.9275",
            "Overlap": "47.06"
        },
        {
            "Title": "Sustainable Tourism Development and Strategies in Ukraine: Balancing Environmental, Social, and Economic Dimensions",
            "Authors": "Krasnokutska I.; Andrenko I.; Cirella G.T.; Radionova O.; Shapovalenko D.; Kraynyuk L.; Kharchenko O.; Kolontaievskyi O.; Bogdan N.; Aleksandrova S.; Balandina I.; Sokolenko A.",
            "abstract": "This chapter examines various aspects of sustainable tourism development, elucidating its key principles, challenges, and strategies for implementation—showcasing the potential significance for regional prosperity and national progress in post-war Ukraine. Given that the efficacy of managing tourism relies heavily on human agency and societal dynamics, the integration of sustainable development concepts presents a partial remedy. However, based on data predating 2022, self-regulation mechanisms within the tourism sector prove inadequate in ensuring consistent advancement, particularly when confronted with the conditions stemming from the global outbreak of the COVID-19 pandemic. A pivotal objective in this post-war context involves identifying effective paradigms and principles that comprehensively address consumer needs while reestablishing equilibrium between society and the environment. The synergy among commerce, government, and the community—imperative for proficient tourism management—nurtures progress across environmental, social, and economic dimensions. As a result, the evaluation of sustainable development principles underscores the mutual benefits of cultivating growth in regional tourism. These principles align with the United Nations Sustainable Development Goals, facilitating a harmonious interplay between optimized environmental resource utilization, vital for preserving natural ecosystems, enhancing public well-being, and safeguarding the authenticity of cultural heritage. The all-encompassing involvement of stakeholders and the achievement of consensus underpin the proactive ethos of sustainability, fortified by strategic planning aimed at shaping competitive tourism offerings. Moreover, the chapter delves into the integration of sustainable business management practices and engages with framing sustainable development in terms of both internal and external factors impacting the tourism and hospitality industry. The research pinpoints crucial focal areas for formulating an effective management approach and underscores the reciprocal relationship connecting tourism, hospitality, and sustainable development, recognizing the dual impact of anthropogenic and artificial influences on the environment, alongside the reciprocal effects of tourism on the natural world. © The Author(s), under exclusive license to Springer Nature Switzerland AG 2024.",
            "DOI": "https://doi.org/10.1007/978-3-031-48735-4_15",
            "Similarity": "0.9263",
            "Overlap": "41.18"
        },
        {
            "Title": "The effectiveness of applying the economic and technological dimensions of the kingdom of Saudi Arabia’s vision 2030 to achieve the competitive advantage of the Hail Region",
            "Authors": "Alhamad S.H.; Bani Hani S.I.; Dakhli A.C.; Almahayreh A.S.",
            "abstract": "This research focuses on examining the impact of Saudi Arabia’s Vision 2030 on the energy industry, specifically in the Hail region, by exploring the role of technological and economic strategies in fostering sustainable energy development. The study aims to identify key factors that facilitate the implementation of Vision 2030 to assess the current energy landscape in Saudi Arabia. By delving into the economic and technological dimensions of Vision 2030, the research seeks to determine the essential components that the Kingdom of Saudi Arabia needs to establish systems and initiatives that align with global scientific and technological advances, ensuring competitiveness and progress in the global arena. By surveying 60 faculty members from Hail University, the study employs a descriptive-analytical approach to unravel how economic activities and technological advancements collaborate to shape a sustainable and competitive energy sector. The findings highlight the crucial role of technological innovations, including advances in administrative processes, human resource management, regulatory frameworks, and technical infrastructure related to energy efficiency and renewable energy technologies. Furthermore, the study evaluates economic aspects such as labor market reforms, skill development programs, and support for emerging energy enterprises. The results underscore the positive impact of technological and economic interventions on the energy sector in the Hail region, with significant improvements in energy project management efficiency and the creation of a conducive environment for sustainable energy practices. The study reveals that the integration of technological and economic initiatives has led to notable improvements in the energy sector, reflected in average values ranging from 68% to 84%. These results underscore the fundamental role of Vision 2030 in advancing sustainable energy development and underscore the importance of leveraging economic and technological strategies to achieve energy sustainability and competitive advantage. This research contributes to understanding how Saudi Arabia’s Vision 2030 is driving progress in the energy industry and emphasizes the importance of integrating economic and technological approaches in shaping a sustainable energy landscape. The findings provide valuable information for policymakers and stakeholders in the energy sector, highlighting the need for concerted efforts to harness economic and technological advancements to promote sustainable energy development. By showcasing the transformative impact of Vision 2030 on the energy sector in the Hail region, this study underscores the originality and importance of research in advancing the goals of sustainable energy development in Saudi Arabia. Copyright © 2024 Alhamad, Bani Hani, Dakhli and Almahayreh.",
            "DOI": "https://doi.org/10.3389/fenrg.2024.1337349",
            "Similarity": "0.9262",
            "Overlap": "58.82"
        }
    ],
    "model": "fasttext",
    "sim_measure": "cosine"
}