{
    "query": "sustainable development of cities and infrastructure",
    "start_year": 2024,
    "end_year": 2024,
    "results_per_year": 13016,
    "top_n": 5,
    "results": [
        {
            "Title": "Scale optimization of urban agglomerations based on the connection strength between cities under the framework of sustainable development",
            "Authors": "Meng Q.; Zhang Z.; Fei X.; Guo Y.; Xiao R.",
            "abstract": "Sustainable development is a common goal across the world. As the core force to promote economic growth and enhance national competitiveness, the sustainable development of urban agglomeration is a key component of national strategy. This study explored the scale optimization in the Yangtze River Delta Urban Agglomeration (YRDUA) under the framework of sustainable development. Results showed that the sustainability of the overall urban agglomeration development is not optimal. With the increase in cities, the sustainability of the city combination formed with Shanghai as the seed point showed a trend of increasing at first and then decreasing. When the number of city group is 6, the sustainable development goal (SDG) index score is the highest. It indicated that the combination formed by some cities may be superior to urban agglomeration in sustainability. Therefore, the concept of pan-metropolitan area was proposed, and at current stage, the pan-metropolitan area should be developed first to achieve sustainable development within a smaller urban group, and then to build high-quality and coordinated development at the entire urban agglomeration. Finally, a road of urban agglomeration integration and international development from part to whole will be established. © The Author(s), under exclusive licence to Springer Nature B.V. 2023.",
            "DOI": "https://doi.org/10.1007/s10668-023-03466-9"
        },
        {
            "Title": "An Ecological Study of Garden Cities (Case Study: Iranian Garden Cities—Isfahan)",
            "Authors": "Khorasgani A.M.; Villalobos M.H.; Eskandar G.A.",
            "abstract": "Cities’ growth and rising demand for energy resources have created problems and hazards for human life due to resource depletion. Therefore, it is crucial to establish a framework that promotes resource efficiency to achieve sustainable development and energy preservation, which is now a vital daily requirement. Developing ecosystem services in today’s cities can guarantee resources for future generations, urban health, and the realization of a healthy city and life. Research on Iranian–Islamic garden cities has revealed their structure shares similarities and adaptations with the overall ecosystem services framework. These garden cities were designed to create healthy urban environments in their time and can serve as a model for developing sustainable towns today. Meanwhile, the Isfahan Garden City in the Safavid period is a perfect example of various sustainability and ecological functions. The analysis of the Isfahan city garden from the perspective of different sub-structures, including water, green, social, and economic, makes it possible to achieve this goal. This research aimed to compare Iranian–Islamic garden cities with typical urban areas, focusing on the various aspects of ecosystem services, their classification, and the strategies for developing sustainable and green cities. The study also analyzed the infrastructure services of Isfahan, a prominent Iranian–Islamic garden city, and explored how these services align with the ecosystem services of green cities. The research aimed to identify which ecosystem services present in Iranian–Islamic garden cities are compatible with the strategies for creating green cities. Or the answer to this year, which ecosystem service items have been considered in the design of Iranian–Islamic garden cities, especially Isfahan? The Iranian garden cities have established essential regulations and ecosystem support infrastructure, instrumental in their sustained existence as green and sustainable cities. These cities have promoted the creation of healthy urban environments and contributed to the ecosystem’s overall health. As a result, these garden cities have become crucial for the continuity of life and the sustainable development of both themselves and their residents. © The Author(s), under exclusive license to Springer Nature Switzerland AG 2024.",
            "DOI": "https://doi.org/10.1007/978-3-031-49495-6_7"
        },
        {
            "Title": "Sustainable efficiency in cities in China—An interaction model among water, energy, and industry",
            "Authors": "Fang Z.; Luo N.; Chiu Y.-H.",
            "abstract": "With the inclusion of “Building Inclusive, safe, Resilient and Sustainable Cities and human Settlements” (SDG11) in the United Nations Sustainable Development Goals (SDGS), the movement to promote sustainable development from an urban perspective is growing globally. Many studies examine urban sustainability efficiency from multiple dimensions, but scant attention targets the interaction among various dimensions. This research combines the water-energy-industry subsystem to evaluate the sustainable development performance of 29 provinces in China from 2018 to 2020. The results show that 1) a water system plays an important role in promoting a city's overall sustainable performance. 2) Urban sustainable efficiency has the characteristics of low value aggregation and high value dispersion in space. 3) Regional and sub-system sustainability efficiencies exhibit clear heterogeneity. 4) Rainfall improves the sustainable efficiency of cities, mainly through water systems. 5) The coupling between water and industrial subsystems is better than that between energy and industrial subsystems, and the coupling between the central region subsystem is the best. This paper offers a new perspective for understanding the current state of sustainability in China's provinces and provides more specific suggestions for improving regional sustainability efficiency in the future. © 2024 Elsevier B.V.",
            "DOI": "https://doi.org/10.1016/j.scitotenv.2024.172154"
        },
        {
            "Title": "Monitoring Hyderabad's Carbon Emission using Machine Learning for Sustainability Assessment of Smart Cities",
            "Authors": "Gill K.S.; Reddy G.R.S.; Kumar M.; Rawat R.; Hsiung P.-A.",
            "abstract": "This research is about the assessment of Hyderabad City to reach SDG 11 goal, SDG(Sustainable development goal)11-Goal 11 is about making cities and human settlements inclusive, safe, resilient and sustainable. Today, more than half the world's population live in cities. By 2050, an estimated 7 out of 10 people will likely live in urban areas. As Hyderabad a upcoming mega city of India possible be the IT and Financial Capital of India and also the host to Countries defence and missile research centre DRDO, was already a big city but for the last two years this city name was spoken all over the world for being the best place to start up and invest because of having a good ecosystem with good logical support and was told will be a mega city and leading world IT by the year 2030 and will be growing more till 2050, so to make the city more sustainable development this paper will assess the past carbon emissions and also predict the future trends and also be predicting some Sustainable Development aspects like future transport pollutions and future road and transportation upgrade to be made in order to make the city resilient and make it go forward in an Sustainable manner. The research utilizes the Hyderabad city data from the year 1993 to 2019 and came up with the Emission Factor and Formulae to give the Carbon Estimates and made the Carbon estimates data set from the year 2002 to 2019 for the Transport sector and also predicted the vehicles growth and the carbon estimates till the year 2030. © 2024 IEEE.",
            "DOI": "https://doi.org/10.1109/ISCS61804.2024.10581384"
        },
        {
            "Title": "Multiple evaluation framework of sustainability development in resource-based cities: A case study of China",
            "Authors": "Liu Q.; Li F.; Peng L.; Dong S.; Yang Y.; Cheng H.",
            "abstract": "Sustainable Urban development is an immortal challenge for the world, among which resource-based cities (RBCs) face more complex dilemmas due to their special characteristics. This determines that they are the key areas and difficult areas to achieve sustainable development. This study is oriented to the Sustainable Development Goals (SDGs) and constructs a research framework for sustainable development of resource-based cities based on the deconstruction of the SDGs of RBCs. A comprehensive sustainable development evaluation framework was constructed based on DPSIR-Entory, and ESDA and Geographically Weighted Regression (GWR) models were used to study the sustainability transition effects of RBCs. Based on this, a System Dynamics (SD) model was constructed to predict and simulate the future development of resource-based cities under different scenarios. The results indicated that (1) there is a significant spatial clustering of the sustainable transformation ability of RBCs. (2) different RBCs achieve sustainable development at different rates, and low-growth RBCs show a trend of shifting from the northwest region and the southwest region to the northeast region. (3) DPSIR has different promoting or inhibiting effects on enhancing the sustainable development impact of RBCs regions. (4) to attain sustainable development of RBCs, it is crucial to strike a balance in implementing policies within a multifaceted urban system. This study provides an in-depth analysis of the current situation, problems, opportunities and challenges of the transformation and sustainable development of RBCs nationwide and proposes countermeasures. In order to enhance the study of sustainable development of RBCs, it is of great practical significance for the national RBCs to break the resource curse dilemma and achieve sustainable development. © 2024 The Authors",
            "DOI": "https://doi.org/10.1016/j.ecolind.2023.111338"
        }
    ],
    "model": "use",
    "sim_measure": "cosine"
}