{"use": {"index": 9985, "abstract": "Enhancing agricultural productivity in developing countries is crucial for attaining the sustainable development goal 2.4 by 2030 through integrating information and communication technology (ICT) and renewable energy. Thus, this study investigates the role of ICT, renewable energy, and agricultural credit in enhancing agricultural productivity in developing countries from 2000 to 2021. This study has used the ‘Driscoll-Kraay and the Method of Moments Quantile Regression’ for robust empirical analysis. The estimated results indicate that renewable energy, ICT, and agricultural credit can enhance agricultural productivity in developing countries. The robustness analysis, however, indicates that the moderation effects of the interaction of ICT with renewable energy and agricultural credit with ICT and renewable energy have a weak and insignificant effect on agricultural productivity over the increasing quantiles. From a policy viewpoint, it is suggested that coherent and effective policies be implemented to encourage the advancement of formal credit institutions to bridge the gap between farmers and lending institutions offering flexible lending options to farmers. Thus, this helps farmers to access and deploy modern technologies and renewable energy in the agricultural field, which ensures sustainable agricultural practices to foster agricultural productivity while enriching environmental quality in developing countries. © 2024 Informa UK Limited, trading as Taylor & Francis Group."}, "stf": {"index": 836, "abstract": "The science, technology, engineering, and mathematics (STEM) education research delves into the core of sustainable development goals (SDGs), including the pillars of quality education (SDG4), robust economic growth (SDG8), and diminished inequalities (SDG10). These pursuits stand as keystones in sculpting inclusive societies and bridging societal gaps. While previous studies utilising data envelopment analysis (DEA) have explored educational performance mainly from a macro-perspective, there is a lack of micro-perspective investigation. Our study aims to fill this gap by proposing a DEA approach to assess the relative efficiency of engineering classes. We analysed 70 classes covering 38 subjects in the first semester of 2022 at a South American school. Methodologically, we employed the slack-based measure (SBM) model under the benefit of doubt (BoD) condition. Unlike prior research, we analysed classes' relative performance considering different pedagogical approaches - 11 active-learning classes (15.7 %) and 59 passive-learning classes (84.3 %). Our results showed that 18 classes were efficient (25.7 %). Active classes were more efficient, but few subjects maintained similar efficiencies for all classes. Moreover, efficient classes were concentrated in the last two years prior to graduation (57.9 %). This may represent an additional barrier for low-income students, who tend to drop out in the first years. The findings support several improvement recommendations, such as integrating digital technologies, boosting active learning opportunities, and bolstering classes in foundational subjects. Also, implications for researchers, decision- and policy-makers are discussed. Our approach can be replicated in diverse educational contexts, enabling the identification of strengths and weaknesses for more efficient educational management. © 2024 Elsevier Ltd"}}