{
    "use": {
        "index": 9397,
        "abstract": "this chapter discusses the concept of measuring the positive social impact of startups that incorporate un sustainable development goals sdgs in their mission the impact assessment allows for quantifying the outcomes a startup achieves by implementing its strategy measuring the social impact in startups is also driven by the expectations of investors who expect a coherent tool to compare performance and decide about potential investments a review of the existing literature revealed a number of different methodologies for assessing the magnitude of the social impact for startups as well as investors and large companies with whom startups build relations the goal of this chapter is to propose a framework to measure the social impact that we apply for the case study analysis of eight impact startups the set of metrics to measure positive social impact allows for assessing the implementation of un sdgs and corresponds with the expectations of impact investors  2024 selection and editorial matter katarzyna bachnik magdalena kamierczak magdalena rojeknowosielska magdalena stefaska and justyna szumniaksamolej individual chapters the contributors"
    },
    "stf": {
        "index": 836,
        "abstract": "The science, technology, engineering, and mathematics (STEM) education research delves into the core of sustainable development goals (SDGs), including the pillars of quality education (SDG4), robust economic growth (SDG8), and diminished inequalities (SDG10). These pursuits stand as keystones in sculpting inclusive societies and bridging societal gaps. While previous studies utilising data envelopment analysis (DEA) have explored educational performance mainly from a macro-perspective, there is a lack of micro-perspective investigation. Our study aims to fill this gap by proposing a DEA approach to assess the relative efficiency of engineering classes. We analysed 70 classes covering 38 subjects in the first semester of 2022 at a South American school. Methodologically, we employed the slack-based measure (SBM) model under the benefit of doubt (BoD) condition. Unlike prior research, we analysed classes' relative performance considering different pedagogical approaches - 11 active-learning classes (15.7 %) and 59 passive-learning classes (84.3 %). Our results showed that 18 classes were efficient (25.7 %). Active classes were more efficient, but few subjects maintained similar efficiencies for all classes. Moreover, efficient classes were concentrated in the last two years prior to graduation (57.9 %). This may represent an additional barrier for low-income students, who tend to drop out in the first years. The findings support several improvement recommendations, such as integrating digital technologies, boosting active learning opportunities, and bolstering classes in foundational subjects. Also, implications for researchers, decision- and policy-makers are discussed. Our approach can be replicated in diverse educational contexts, enabling the identification of strengths and weaknesses for more efficient educational management. © 2024 Elsevier Ltd"
    }
}