{
    "use": {
        "index": 10740,
        "abstract": "Today, education continues to be seen as a central part of the solutions for sustainability. There is a tendency in the educational literature to underline the importance of defining the proper competencies to design and teach successfully. These competencies provide a clear and collective agenda for creating different and identifiable profiles of the educational field, the schools, graduates, the professionals, and so forth. The following paper deals with a radical vision of education for sustainability, which informs the need for a concrete transformation of the educational processes and objectives that specifically outline the knowledge, competencies, and skills required for designers who intend to work at various levels in the field of sustainability. In order to define the relationship between learning goals/results and trace the evolution of the curriculum itself, the work systematizes the main taxonomies about processes and objectives related to the field of education (Bloom BS, Krathwohl DR in Taxonomy of educational objectives: The classification of educational goals. Cognitive domain. Longman, London, 2020), education for Sustainability (Wiek et al. in Sustainability Science 6:203–218, 2011), and the theories about the Education for Sustainable development pedagogical levels of transformation (Sterling in JLTHE 2011:17–33, 2010). The result of this process illustrates the definition of Competencies, Capabilities, and Acquired Skills in teaching and learning fashion design for sustainability through a holistic approach based on the sustainability pillars: Environment, Economy, Society, and Culture. © The Author(s), under exclusive license to Springer Nature Switzerland AG 2024."
    },
    "stf": {
        "index": 836,
        "abstract": "The science, technology, engineering, and mathematics (STEM) education research delves into the core of sustainable development goals (SDGs), including the pillars of quality education (SDG4), robust economic growth (SDG8), and diminished inequalities (SDG10). These pursuits stand as keystones in sculpting inclusive societies and bridging societal gaps. While previous studies utilising data envelopment analysis (DEA) have explored educational performance mainly from a macro-perspective, there is a lack of micro-perspective investigation. Our study aims to fill this gap by proposing a DEA approach to assess the relative efficiency of engineering classes. We analysed 70 classes covering 38 subjects in the first semester of 2022 at a South American school. Methodologically, we employed the slack-based measure (SBM) model under the benefit of doubt (BoD) condition. Unlike prior research, we analysed classes' relative performance considering different pedagogical approaches - 11 active-learning classes (15.7 %) and 59 passive-learning classes (84.3 %). Our results showed that 18 classes were efficient (25.7 %). Active classes were more efficient, but few subjects maintained similar efficiencies for all classes. Moreover, efficient classes were concentrated in the last two years prior to graduation (57.9 %). This may represent an additional barrier for low-income students, who tend to drop out in the first years. The findings support several improvement recommendations, such as integrating digital technologies, boosting active learning opportunities, and bolstering classes in foundational subjects. Also, implications for researchers, decision- and policy-makers are discussed. Our approach can be replicated in diverse educational contexts, enabling the identification of strengths and weaknesses for more efficient educational management. © 2024 Elsevier Ltd"
    }
}